pages/blog/06-Sep-2023.htm
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-06 Wed 18:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>06 Sep 2023 - Main Site Updates</title>
<meta name="description" content="Explaining that I am now focusing on the main site while looking for the best way to publish this one" />
<meta name="generator" content="Org Mode" />
<link href="../../styles/main.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">06 Sep 2023 - Main Site Updates</h1>
<p>
This site is essentially done for now. There may be a few things that I would like to set up in the future, but those will all probably take a lot of time and effort to research and complete. I am satisfied with what I have so far and will now be happy to figure out how I want to upload this to my server for all to see! Yes, none of the previous blog entries were available to read when they were written! I mostly wrote them for myself. Speaking of the server though, I <i>do</i> have a site! And that site has seen a <i>big</i> shift on what its about and its contents!
</p>
<div id="outline-container-org22a45a6" class="outline-2">
<h2 id="org22a45a6">The main site</h2>
<div class="outline-text-2" id="text-org22a45a6">
<p target="_top">
The main site is called <a href="https://onigirionegai.info" target="_top">Onigiri☆Onegai</a>! It used to be a site set up for me to showcase stories done in a type of visual novel style using only HTML, JavaScript, and a splash of PHP. While the idea for this new type of web-based VN was, I believe and still believe, a good one, I don&rsquo;t have the patience or time to work on such large projects especially if I am doing all the work from, writing, to story boarding, to drawing, to programming. I had partners, but they are also busy and I just can&rsquo;t do it all myself. To be clear, I am not blaming them, I am also busy, it just led to a shift in what the site is and the type of content that is there.
</p>
</div>
</div>
<div id="outline-container-orgd03348a" class="outline-2">
<h2 id="orgd03348a">The updates!</h2>
<div class="outline-text-2" id="text-orgd03348a">
<p>
So the main site will no longer be for hosting those web-based VNs, at least for the time being. Actually, the plan would be to give each VN its own site that would be styled to it specifically not a blanket site with a unified design. The main site is, therefore, transitioning to a site that:
</p>
<ol class="org-ol">
<li>Gives information about the people working on projects</li>
<li>Showcases other sites</li>
<li>Collects news about our members and projects</li>
</ol>
<p>
This is, mostly, already done. I am actually using Hugo to build that site because its easier to build with than using Emacs alone. I use Emacs here because I have the frames set up with, what is basically, a separate page for the navigation bar, so its easier to generate just directly from Emacs and org-mode than to build a whole modern site. Hugo is really better for that.
</p>
</div>
</div>
<div id="outline-container-orgd8458ba" class="outline-2">
<h2 id="orgd8458ba">What does this mean for this site?</h2>
<div class="outline-text-2" id="text-orgd8458ba">
<p>
Sadly, for the time being, I will be working on it less. Where possible, I will still be doing blog entries every week, but other pages and sections may not see as much work. Of course, as I said, much of it is in maintenance mode, so it isn&rsquo;t a big deal right now. I will also be looking at the best way to deploy this to the same server that is hosting the main site so all can see this testament to 90&rsquo;s design! Once I do that, I may look at building or sourcing, additional web applications, like maybe a forum. We shall see!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-09-06 Wed 18:44</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.7)</p>
</div>
</body>
</html>